int/resources/objectRepo/xmlTemplates/opera/ExternalSystemsConfig/req_ChangeUDFMapping.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:ChangeUDFMappingRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:UDFMapping Type="?">
            <v91:UDFName/>
            <v91:UDFLabel/>
            <v91:Inactive/>
            <v91:UpdateAllowed/>
         </v9:UDFMapping>
      </v9:ChangeUDFMappingRQ>
   </soapenv:Body>
</soapenv:Envelope>